{"config": [{"config": {"batch_input_shape": [null, 2, 26], "dtype": "float32", "name": "masking_1", "trainable": true, "mask_value": -1}, "class_name": "Masking"}, {"config": {"activity_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "unroll": false, "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1", "units": 32, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "recurrent_dropout": 0.0, "batch_input_shape": [null, 2, 26], "go_backwards": false, "unit_forget_bias": true, "use_bias": true, "dropout": 0.0, "trainable": true, "kernel_constraint": null, "return_state": false, "bias_constraint": null, "recurrent_regularizer": null, "activation": "tanh", "implementation": 1}, "class_name": "LSTM"}, {"config": {"batch_input_shape": [null, 32], "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true, "units": 12, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Sequential"}